C03/Nz100/Nz100_ref/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "./setUp/parameters"

convertToMeters 1;

//Number of volumes
nx 	 	$numOfVol_x;
nz_1 	 	$numOfVol_concrete;
nz_2 	 	$numOfVol_interface;
nz_3 	 	$numOfVol_Air;


//Geometry
Ly              $h0; 
Lz_1 	 	$h0;
Lz_2		#calc "$h0 * 2";
Lz_3 	 	$Lz;

vertices        
(
   (0       0            0)   //ponto 0
   ($Lx     0            0)   //ponto 1
   (0       $Ly          0)   //ponto 2
   ($Lx     $Ly          0)   //ponto 3
   (0       0            $Lz_1) //ponto 4
   ($Lx     0            $Lz_1) //ponto 5
   (0       $Ly          $Lz_1) //ponto 6
   ($Lx     $Ly          $Lz_1) //ponto 7
   (0       0            $Lz_2) //ponto 8
   ($Lx     0            $Lz_2) //ponto 9
   (0       $Ly          $Lz_2) //ponto 10
   ($Lx     $Ly          $Lz_2) //ponto 11
   (0       0            $Lz_3)   //ponto 12
   ($Lx     0            $Lz_3)   //ponto 13
   (0       $Ly          $Lz_3)   //ponto 14
   ($Lx     $Ly          $Lz_3)   //ponto 15
);

// Dx =  m, Dy =*****, Dz = m

blocks          
(
    hex (0  1 3  2  4  5  7   6) ($nx 1 $nz_1) simpleGrading (1 1 1) //Bloco 0 carbopol
    hex (4  5 7  6  8  9  11 10) ($nx 1 $nz_2) simpleGrading (1 1 1) //Bloco 1 ar
    hex (8  9 11 10 12 13 15 14) ($nx 1 $nz_3) simpleGrading (1 1 1) //Bloco 2 ar
);

edges
(
);

patches
(
    patch inlet_water
    (
        (0 4 6 2)
    )
    patch inlet_air
    (
	(4 8  10 6)
	(8 12 14 10)
    )
    patch outlet_water
    (
	(1 3 7 5)
    )
    patch outlet_air
    (
        (5 7  11 9)
	(9 11 15 13)
    )
    wall lowerWall
    (
        (0 2 3 1)
    )
    wall atmosphere
    (
        (12 14 15 13)
    )
    );
    
    defaulfaces
    {
        type empty; //Pois é um modelo 2D, se for 3D usar mesmas condicoes do fundo
 faces
        (
            (0  1  5  4) //frente
            (4  5  9  8)
	    (8  9  13 12)
            (2  6  7  3) //fundo
            (6  10 11 7)
	    (10 14 15 11)
	   
        );
    }


mergePatchPairs
(
);

// ************************************************************************* //


